In [1]:
import pandas as pd

In [11]:
data=pd.read_csv('C:\\Users\\Suman\\Desktop\\STUDY STUFF\\Customers.csv')

In [12]:
data

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,1,Male,19,15000,39,Healthcare,1,4
1,2,Male,21,35000,81,Engineer,3,3
2,3,Female,20,86000,6,Engineer,1,1
3,4,Female,23,59000,77,Lawyer,0,2
4,5,Female,31,38000,40,Entertainment,2,6
...,...,...,...,...,...,...,...,...
1995,1996,Female,71,184387,40,Artist,8,7
1996,1997,Female,91,73158,32,Doctor,7,7
1997,1998,Male,87,90961,14,Healthcare,9,2
1998,1999,Male,77,182109,4,Executive,7,2
1999,2000,Male,90,110610,52,Entertainment,5,2

# Display top 10 rows of the dataset

In [13]:
data.head(10)

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,1,Male,19,15000,39,Healthcare,1,4
1,2,Male,21,35000,81,Engineer,3,3
2,3,Female,20,86000,6,Engineer,1,1
3,4,Female,23,59000,77,Lawyer,0,2
4,5,Female,31,38000,40,Entertainment,2,6
5,6,Female,22,58000,76,Artist,0,2
6,7,Female,35,31000,6,Healthcare,1,3
7,8,Female,23,84000,94,Healthcare,1,3
8,9,Male,64,97000,3,Engineer,0,3
9,10,Female,30,98000,72,Artist,1,4

# Displaying last 10 rows of the dataset

In [14]:
data.tail(10)

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
1990,1991,Female,30,166983,69,Artist,7,3
1991,1992,Female,97,129444,96,Entertainment,5,6
1992,1993,Male,94,181183,24,Marketing,9,3
1993,1994,Female,64,175254,100,Artist,9,5
1994,1995,Female,19,54121,89,Engineer,6,3
1995,1996,Female,71,184387,40,Artist,8,7
1996,1997,Female,91,73158,32,Doctor,7,7
1997,1998,Male,87,90961,14,Healthcare,9,2
1998,1999,Male,77,182109,4,Executive,7,2
1999,2000,Male,90,110610,52,Entertainment,5,2

# Checking the datatype of each column

In [15]:
data.dtypes

CustomerID                 int64
Gender                    object
Age                        int64
Annual Income ($)          int64
Spending Score (1-100)     int64
Profession                object
Work Experience            int64
Family Size                int64
dtype: object

# Checking the null values in the dataset

In [16]:
data.isnull()

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
1995,False,False,False,False,False,False,False,False
1996,False,False,False,False,False,False,False,False
1997,False,False,False,False,False,False,False,False
1998,False,False,False,False,False,False,False,False
1999,False,False,False,False,False,False,False,False

In [17]:
data.isnull().sum()

CustomerID                0
Gender                    0
Age                       0
Annual Income ($)         0
Spending Score (1-100)    0
Profession                0
Work Experience           0
Family Size               0
dtype: int64

In [9]:
data.isnull().sum

<bound method NDFrame._add_numeric_operations.<locals>.sum of       CustomerID  Gender    Age  Annual Income ($)  Spending Score (1-100)  \
0          False   False  False              False                   False
1          False   False  False              False                   False
2          False   False  False              False                   False
3          False   False  False              False                   False
4          False   False  False              False                   False
...          ...     ...    ...                ...                     ...
1995       False   False  False              False                   False
1996       False   False  False              False                   False
1997       False   False  False              False                   False
1998       False   False  False              False                   False
1999       False   False  False              False                   False

      Profession  Work Experience  Family Size
0          False            False        False
1          False            False        False
2          False            False        False
3          False            False        False
4          False            False        False
...          ...              ...          ...
1995       False            False        False
1996       False            False        False
1997       False            False        False
1998       False            False        False
1999       False            False        False

[2000 rows x 8 columns]>

In [18]:
data.isnull().sum(axis=1)

0       0
1       0
2       0
3       0
4       0
       ..
1995    0
1996    0
1997    0
1998    0
1999    0
Length: 2000, dtype: int64

In [19]:
data.shape

(2000, 8)

In [20]:
data.columns

Index(['CustomerID', 'Gender', 'Age', 'Annual Income ($)',
       'Spending Score (1-100)', 'Profession', 'Work Experience',
       'Family Size'],
      dtype='object')

In [21]:
len(data.columns)

8

In [23]:
len(data)

2000

In [24]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 8 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   CustomerID              2000 non-null   int64
 1   Gender                  2000 non-null   object
 2   Age                     2000 non-null   int64
 3   Annual Income ($)       2000 non-null   int64
 4   Spending Score (1-100)  2000 non-null   int64
 5   Profession              2000 non-null   object
 6   Work Experience         2000 non-null   int64
 7   Family Size             2000 non-null   int64
dtypes: int64(6), object(2)
memory usage: 125.1+ KB

# Highest and Lowest Annual Income

In [26]:
print(data['Annual Income ($)'].max())
print(data['Annual Income ($)'].min())

189974
0

# Highest and Lowest spending Score

In [28]:
print(data['Spending Score (1-100)'].max())
print(data['Spending Score (1-100)'].min())

100
0

# Average Income

In [29]:
data['Annual Income ($)'].mean()

110731.8215

# Average Spending Score

In [30]:
data['Spending Score (1-100)'].mean()

50.9625

# Peoples having Work Experience more than 10 based on a rating Scale

In [32]:
data[data['Work Experience']>10]

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
20,21,Male,35,96000,35,Homemaker,12,1
22,23,Female,46,42000,5,Artist,13,2
42,43,Male,48,22000,36,Artist,14,3
47,48,Female,27,71000,47,Healthcare,12,1
55,56,Male,47,95000,41,Artist,14,2
...,...,...,...,...,...,...,...,...
1288,1289,Female,98,51866,81,Artist,12,7
1549,1550,Female,80,68341,22,Artist,13,6
1695,1696,Female,18,149915,94,Doctor,14,1
1840,1841,Female,43,73915,47,Artist,11,2
1873,1874,Female,44,173682,89,Artist,12,6

In [33]:
len(data[data['Work Experience']>10])

87

In [34]:
data[data['Work Experience']>10].count()

CustomerID                87
Gender                    87
Age                       87
Annual Income ($)         87
Spending Score (1-100)    87
Profession                87
Work Experience           87
Family Size               87
dtype: int64

# Displaying Profession having Engineering

In [36]:
data[data['Profession'].str.contains('Engineer')]

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
1,2,Male,21,35000,81,Engineer,3,3
2,3,Female,20,86000,6,Engineer,1,1
8,9,Male,64,97000,3,Engineer,0,3
10,11,Male,67,7000,14,Engineer,1,3
44,45,Female,49,72000,28,Engineer,8,1
...,...,...,...,...,...,...,...,...
1959,1960,Female,85,155432,21,Engineer,4,6
1961,1962,Female,52,106530,46,Engineer,7,2
1972,1973,Male,98,104249,12,Engineer,5,2
1976,1977,Male,60,127438,82,Engineer,7,2
1994,1995,Female,19,54121,89,Engineer,6,3

In [37]:
len(data[data['Profession'].str.contains('Engineer')])

180

# Peoples whose Profession Is Engineer and having their Spending Score more than 50

In [43]:
data[(data['Profession']=='Engineer') & (data['Spending Score (1-100)']>=50)]

,CustomerID,Gender,Age,Annual Income ($),Spending Score (1-100),Profession,Work Experience,Family Size
1,2,Male,21,35000,81,Engineer,3,3
78,79,Female,23,97000,52,Engineer,2,2
122,123,Female,40,97000,58,Engineer,9,4
151,152,Male,39,41000,88,Engineer,0,1
179,180,Male,35,42000,90,Engineer,8,1
...,...,...,...,...,...,...,...,...
1877,1878,Male,16,150193,83,Engineer,2,2
1886,1887,Female,69,104160,77,Engineer,4,4
1904,1905,Male,94,112426,54,Engineer,9,6
1976,1977,Male,60,127438,82,Engineer,7,2
1994,1995,Female,19,54121,89,Engineer,6,3

In [44]:
len(data[(data['Profession']=='Engineer') & (data['Spending Score (1-100)']>=50)])

82

In [47]:
data[(data['Profession']=='Engineer') & (data['Spending Score (1-100)']>=50)].count()

CustomerID                82
Gender                    82
Age                       82
Annual Income ($)         82
Spending Score (1-100)    82
Profession                82
Work Experience           82
Family Size               82
dtype: int64

# Finding the age of the person whose Annual Income is 86000

In [50]:
data[data['Annual Income ($)']==86000]['Age']

2      20
104    49
159    30
178    59
Name: Age, dtype: int64

In [51]:
len(data[data['Annual Income ($)']==86000]['Age'])

4

# How many Females and Males in the Dataset

In [54]:
len(data[data['Gender']=='Female'])

1186

In [55]:
len(data[data['Gender']=='Male'])

814

In [56]:
data['Gender'].value_counts()

Female    1186
Male       814
Name: Gender, dtype: int64